In [2]:
import numpy as np
import pandas as pd
%matplotlib inline

In [4]:
df = pd.read_csv('../Data/airline_passengers.csv',index_col='Month',parse_dates=True)

In [6]:
df = df.dropna()

In [8]:
df.index

DatetimeIndex(['1949-01-01', '1949-02-01', '1949-03-01', '1949-04-01',
               '1949-05-01', '1949-06-01', '1949-07-01', '1949-08-01',
               '1949-09-01', '1949-10-01',
               ...
               '1960-03-01', '1960-04-01', '1960-05-01', '1960-06-01',
               '1960-07-01', '1960-08-01', '1960-09-01', '1960-10-01',
               '1960-11-01', '1960-12-01'],
              dtype='datetime64[ns]', name='Month', length=144, freq=None)

In [10]:
df.index.freq = 'MS'

In [12]:
df.head()

            Thousands of Passengers
Month
1949-01-01                      112
1949-02-01                      118
1949-03-01                      132
1949-04-01                      129
1949-05-01                      121

In [16]:
from statsmodels.tsa.holtwinters import SimpleExpSmoothing

In [18]:
span = 12
alpha = 2/(span+1)

In [22]:
df['EWMA12'] =df['Thousands of Passengers'].ewm(alpha=alpha,adjust=False).mean()

In [24]:
df.head()

            Thousands of Passengers      EWMA12
Month
1949-01-01                      112  112.000000
1949-02-01                      118  112.923077
1949-03-01                      132  115.857988
1949-04-01                      129  117.879836
1949-05-01                      121  118.359861

In [28]:
model = SimpleExpSmoothing(df['Thousands of Passengers'])

In [32]:
fitted_model = model.fit(smoothing_level = alpha, optimized=False)

In [44]:
df['SES12']=fitted_model.fittedvalues.shift(-1)

In [46]:
df.head()

            Thousands of Passengers      EWMA12       SES12
Month
1949-01-01                      112  112.000000  112.000000
1949-02-01                      118  112.923077  112.923077
1949-03-01                      132  115.857988  115.857988
1949-04-01                      129  117.879836  117.879836
1949-05-01                      121  118.359861  118.359861